# 1. Дан список lst = [11, 5, 8, 32, 15, 3, 20, 132, 21, 4, 555, 9, 20].
# 2. Необходимо вывести элементы, которые одновременно:
#     1. меньше 30,
#     2. делятся на 3 без остатка.

lst = [11, 5, 8, 32, 15, 3, 20, 132, 21, 4, 555, 9, 20]


def filtr_num(lst):
    for n in lst:
        if n < 30 and n % 3 == 0:
            print(n)


# Вызвать функцию!
filtr_num(lst)